package Lesson_7;

public class work_2 {
    public static void main(String[] args) {
        //2
        // Напишите метод, который бы возвращал в консоль:
        //
        //
        //true, если число больше 5
        //и false, если число меньше 5

        int number = 8;
        System.out.println(number > 5);


    }
}
